<link rel="stylesheet" href="/public/css/search/style.css">
<link rel="stylesheet" href="/public/css/search/preloader/style.css">

<!--Preloader-->
<div class="preloader" id="preloader">
    <div class="container">
        <div class="preloader_inner">
            <div class="container_preloader">
                <div class="loader-container arc-rotate">
                    <div class="loader">
                        <div class="arc"></div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</div>


<!--Main Page-->
<div class="main_page">
    <div class="container">
        <div id='main_page_inner' class="main_page_inner">
            <div class="container_margin">
                <div class="container_margin_TA">
                    <!--Search Page-->
                    <div class="search_page">
                        <!--Left Title-->
                        <div id='up' class="left_title">
                            <div class="left_title_block">
                                <div class="left_title_text">
                                    Поиск на сайте
                                </div>
                                <!--Left Title Navigation-->
                                <div class="left_title_nav">
                                    <div class="left_title_nav_inner">
                                        <div class="left_title_nav_title">
                                            Популярные запросы:
                                        </div>
                                        <div class="left_title_nav_link_block">
                                            <a href="/search?s=Торговые+идеи" class="left_title_nav_link" tabindex="-2">
                                                Торговые идеи
                                            </a>
                                        </div>
                                        <div class="left_title_nav_link_block">
                                            <a href='/search?s=Рекомендации+для+торговли' class="left_title_nav_link about_ta" tabindex="-2">
                                                Рекомендации для торговли
                                            </a>
                                        </div>
                                        <div class="left_title_nav_link_block">
                                            <a href="/search?s=Установка++советника" class="left_title_nav_link" tabindex="-2">
                                                Установка советника
                                            </a>
                                        </div>
                                    </div>
                                </div>
                                <!--Left Title Navigation Mobile-->
                                <div class="left_title_nav_mobile">
                                    <div class="left_title_nav_mobile_wrapper">
                                        <div class="left_title_nav_mobile_inner">
                                            <div class="left_title_nav_mobile_title">
                                                Популярные запросы:
                                            </div>
                                            <div class="left_title_nav_mobile_link_block">
                                                <a href="/search?s=Торговые+идеи" class="left_title_nav_mobile_link">Торговые идеи
                                                </a>
                                            </div>
                                            <div class="left_title_nav_mobile_link_block">
                                                <a href="/search?s=Рекомендации+для+торговли" class="left_title_nav_mobile_link">Рекомендации для торговли
                                                </a>
                                            </div>
                                            <div class="left_title_nav_mobile_link_block">
                                                <a href="/search?s=Установка++советника" class="left_title_nav_mobile_link">Установка советника
                                                </a>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <div id='search_page' class="search_page_inner <?php if($questions): ?>questions<?php endif; ?>">
                            <div class="search_page_pagination_container">
                                <div class="search_page_left">
                                    <!--Search-->
                                    <div class="sp_search">
                                        <div class="sp_search_inner">
                                            <!--Form-->
                                            <form action="/search" method="get" autocomplete="off" class="sp_search_form">
                                                <input type="text" name="s" id="search_input" class="sp_search_block_input" placeholder="Введите ваш вопрос" tabindex="-2"  value="<?php if($query): ?><?=$query?><?php endif; ?>">
                                                <!--Button-->
                                                <button type="submit" value="" class="sp_search_icon_button">
                                                    <!--Svg-->
                                                    <svg class="sp_search_icon" width="18" height="18" viewBox="0 0 18 18"><path fill-rule="evenodd" d="M12.026 10.626L16 14.6 14.6 16l-3.974-3.974a5.5 5.5 0 1 1 1.4-1.4zM7.5 11.1a3.6 3.6 0 1 0 0-7.2 3.6 3.6 0 0 0 0 7.2z"></path></svg>
                                                </button>
                                            </form>
                                        </div>
                                    </div>
                                    <!--Result Message-->
                                    <div class="sp_result_message">
                                        <div class="sp_result_message_inner">
                                            Результат поиска по запросу:
                                            <span class="sp_result_message_text">
                                            <?php if($query): ?>
                                                «<?=$query?>»
                                            <?php endif; ?>
</span>
                                        </div>
                                    </div>
                                    <?php if($questions): ?>
                                        <!--Searching Results-->
                                        <div class="sp_searching_result">
                                            <div class="sp_searching_result_inner">
                                                <?php foreach($questions as $item): ?>
                                                    <!--Item-->
                                                    <div data-id = "<?=$item->id;?>" class="sp_searching_result_item">
                                                        <a href='<?php if($sections):?>/help/<?=$sections[$item->section_id]['alias'];?>?id=<?=$item->id;?><?php endif; ?>' data-href='<?php if($sections):?>/help/<?=$sections[$item->section_id]['alias'];?>?id=<?=$item->id;?><?php endif; ?>' data-id = "<?=$item->id;?>" id="<?=$item->id;?>" class="sp_searching_result_item_inner" tabindex="-2">
                                                            <!--Question-->
                                                            <div class="sp_searching_result_item_question_wrapper">
                                                                <div class="sp_searching_result_item_question">
                                                                    <?php $que = mb_convert_case($query, MB_CASE_UPPER); $qItiem = mb_convert_case($item->question, MB_CASE_UPPER); $rt = str_ireplace($que,"<span style='color: #22a053'>$que</span>", $qItiem); ?>
                                                                    <?php ob_start(); ?>
                                                                    <?=$rt;?>
                                                                    <?php $rm = ob_get_clean(); ?>
                                                                    
                                                                    <?php if($rt[0] == '<'):?>
                                                                        <?php  $rt = substr($rt,29); echo "<span style='color: #22a053'>" . my_ucfirst($rt);?>
                                                                    <?php else: ?>
                                                                        <?php echo my_ucfirst($rt);?>
                                                                    <?php endif; ?>
                                                                
                                                                </div>
                                                            </div>
                                                            <!--Answer-->
                                                            <div class="sp_searching_result_item_answer">
                                                                
                                                                <?php $queL = mb_convert_case($query, MB_CASE_UPPER); $LItiem = mb_convert_case($item->answer, MB_CASE_UPPER); $rL = str_ireplace($queL,"<span style='color: #999; font-weight: bold;'>$queL</span>", $LItiem); ?>
                                                                <?php ob_start(); ?>
                                                                <?=$rL;?>
                                                                <?php $rmL = ob_get_clean(); ?>
                                                                
                                                                <?php if($rL[0] == '<'):?>
                                                                    <?php  $rL = substr($rL,46); echo "<span style='color: #999; font-weight: bold;'>" . my_ucfirst($rL);?>
                                                                <?php else: ?>
                                                                    <?php echo my_ucfirst($rL);?>
                                                                <?php endif; ?>
                                                            </div>
                                                        </a>
                                                        
                                                        <!--Raiting-->
                                                        <div class="sp_searching_result_raiting">
                                                            <div class="sp_searching_result_raiting_inner">
                                                                <div class="sp_searching_result_raiting_text">
                                                                    Оцените ответ:
                                                                </div>
                                                                <div class="sp_searching_result_raiting_stars_block
                                                    <?php if(isset($_COOKIE[$item->id . 'ratingOne'])):?>
                                                        first-click
                                                        <?php elseif (isset($_COOKIE[$item->id . 'ratingTwo'])):?>
                                                            second-click
                                                        <?php elseif (isset($_COOKIE[$item->id . 'ratingThree'])):?>
                                                            third-click
                                                        <?php elseif (isset($_COOKIE[$item->id . 'ratingFour'])):?>
                                                            fourth-click
                                                        <?php elseif (isset($_COOKIE[$item->id . 'ratingFive'])):?>
                                                            fifth-click
                                                    <?php endif; ?>
                                                    ">
                                                                    <!--Svg-->
                                                                    <svg class='sp_searching_result_raiting_star' version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                                                                         viewBox="0 0 512.002 512.002" style="enable-background:new 0 0 512.002 512.002;" xml:space="preserve">
<g>
    <g>
        <path d="M511.267,197.258c-1.764-5.431-6.457-9.389-12.107-10.209l-158.723-23.065L269.452,20.157
      c-2.526-5.12-7.741-8.361-13.45-8.361c-5.71,0-10.924,3.241-13.451,8.361l-70.988,143.827l-158.72,23.065
      c-5.649,0.82-10.344,4.778-12.108,10.208c-1.765,5.431-0.293,11.392,3.796,15.377l114.848,111.954L92.271,482.671
      c-0.966,5.628,1.348,11.314,5.967,14.671c2.613,1.898,5.708,2.864,8.818,2.864c2.388,0,4.784-0.569,6.978-1.723l141.967-74.638
      l141.961,74.637c5.055,2.657,11.178,2.215,15.797-1.141c4.619-3.356,6.934-9.044,5.969-14.672l-27.117-158.081l114.861-111.955
      C511.56,208.649,513.033,202.688,511.267,197.258z"/>
    </g>
</g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
</svg>
                                                                    <!--Svg-->
                                                                    <svg class='sp_searching_result_raiting_star' version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                                                                         viewBox="0 0 512.002 512.002" style="enable-background:new 0 0 512.002 512.002;" xml:space="preserve">
<g>
    <g>
        <path d="M511.267,197.258c-1.764-5.431-6.457-9.389-12.107-10.209l-158.723-23.065L269.452,20.157
      c-2.526-5.12-7.741-8.361-13.45-8.361c-5.71,0-10.924,3.241-13.451,8.361l-70.988,143.827l-158.72,23.065
      c-5.649,0.82-10.344,4.778-12.108,10.208c-1.765,5.431-0.293,11.392,3.796,15.377l114.848,111.954L92.271,482.671
      c-0.966,5.628,1.348,11.314,5.967,14.671c2.613,1.898,5.708,2.864,8.818,2.864c2.388,0,4.784-0.569,6.978-1.723l141.967-74.638
      l141.961,74.637c5.055,2.657,11.178,2.215,15.797-1.141c4.619-3.356,6.934-9.044,5.969-14.672l-27.117-158.081l114.861-111.955
      C511.56,208.649,513.033,202.688,511.267,197.258z"/>
    </g>
</g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
</svg>
                                                                    <!--Svg-->
                                                                    <svg class='sp_searching_result_raiting_star' version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                                                                         viewBox="0 0 512.002 512.002" style="enable-background:new 0 0 512.002 512.002;" xml:space="preserve">
<g>
    <g>
        <path d="M511.267,197.258c-1.764-5.431-6.457-9.389-12.107-10.209l-158.723-23.065L269.452,20.157
      c-2.526-5.12-7.741-8.361-13.45-8.361c-5.71,0-10.924,3.241-13.451,8.361l-70.988,143.827l-158.72,23.065
      c-5.649,0.82-10.344,4.778-12.108,10.208c-1.765,5.431-0.293,11.392,3.796,15.377l114.848,111.954L92.271,482.671
      c-0.966,5.628,1.348,11.314,5.967,14.671c2.613,1.898,5.708,2.864,8.818,2.864c2.388,0,4.784-0.569,6.978-1.723l141.967-74.638
      l141.961,74.637c5.055,2.657,11.178,2.215,15.797-1.141c4.619-3.356,6.934-9.044,5.969-14.672l-27.117-158.081l114.861-111.955
      C511.56,208.649,513.033,202.688,511.267,197.258z"/>
    </g>
</g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
</svg>
                                                                    <!--Svg-->
                                                                    <svg class='sp_searching_result_raiting_star' version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                                                                         viewBox="0 0 512.002 512.002" style="enable-background:new 0 0 512.002 512.002;" xml:space="preserve">
<g>
    <g>
        <path d="M511.267,197.258c-1.764-5.431-6.457-9.389-12.107-10.209l-158.723-23.065L269.452,20.157
      c-2.526-5.12-7.741-8.361-13.45-8.361c-5.71,0-10.924,3.241-13.451,8.361l-70.988,143.827l-158.72,23.065
      c-5.649,0.82-10.344,4.778-12.108,10.208c-1.765,5.431-0.293,11.392,3.796,15.377l114.848,111.954L92.271,482.671
      c-0.966,5.628,1.348,11.314,5.967,14.671c2.613,1.898,5.708,2.864,8.818,2.864c2.388,0,4.784-0.569,6.978-1.723l141.967-74.638
      l141.961,74.637c5.055,2.657,11.178,2.215,15.797-1.141c4.619-3.356,6.934-9.044,5.969-14.672l-27.117-158.081l114.861-111.955
      C511.56,208.649,513.033,202.688,511.267,197.258z"/>
    </g>
</g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
</svg>
                                                                    <!--Svg-->
                                                                    <svg class='sp_searching_result_raiting_star' version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                                                                         viewBox="0 0 512.002 512.002" style="enable-background:new 0 0 512.002 512.002;" xml:space="preserve">
<g>
    <g>
        <path d="M511.267,197.258c-1.764-5.431-6.457-9.389-12.107-10.209l-158.723-23.065L269.452,20.157
      c-2.526-5.12-7.741-8.361-13.45-8.361c-5.71,0-10.924,3.241-13.451,8.361l-70.988,143.827l-158.72,23.065
      c-5.649,0.82-10.344,4.778-12.108,10.208c-1.765,5.431-0.293,11.392,3.796,15.377l114.848,111.954L92.271,482.671
      c-0.966,5.628,1.348,11.314,5.967,14.671c2.613,1.898,5.708,2.864,8.818,2.864c2.388,0,4.784-0.569,6.978-1.723l141.967-74.638
      l141.961,74.637c5.055,2.657,11.178,2.215,15.797-1.141c4.619-3.356,6.934-9.044,5.969-14.672l-27.117-158.081l114.861-111.955
      C511.56,208.649,513.033,202.688,511.267,197.258z"/>
    </g>
</g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
                                                                        <g>
                                                                        </g>
</svg>
                                                                </div>
                                                            </div>
                                                        </div>
                                                    
                                                    </div>
                                                <?php endforeach; ?>
                                            </div>
                                        </div>
                                    <?php else: ?>
                                        <!--No Search Results-->
                                        <div class="sp_no_search_result">
                                            <div class="sp_no_search_result_inner">
                                                <!--Svg-->
                                                <svg class='sp_no_search_result_svg' xmlns="http://www.w3.org/2000/svg" viewBox="0 0 387.78 317.47"><defs><style>.cls-12{fill:#f5f5f5;}.cls-2{fill:#263238;}.cls-3{fill:#fff;}.cls-4{fill:#2da98c;}.cls-5{opacity:0.2;}</style></defs><g id="Слой_2" data-name="Слой 2"><g id="Character"><g id="Shadow"><ellipse id="_Path_" data-name="&lt;Path&gt;" class="cls-12" cx="193.89" cy="306.15" rx="193.89" ry="11.32"/></g><path class="cls-2" d="M304.49,153l-.36,0c-26.64-2.18-45-24.95-45.74-25.91a4.47,4.47,0,0,1,7-5.56c.21.27,15.9,19.61,37.62,22.37,7.05-7,13-25.48,12.34-31.07a.88.88,0,0,1,0-.16c-.15-1.8-.48-8,1.29-11.64a4.47,4.47,0,0,1,8.05,3.87c-.44.92-.65,4.24-.44,7,1,9.2-7,32.42-17,40.19A4.48,4.48,0,0,1,304.49,153Z"/><path class="cls-2" d="M92.71,128.73a65.82,65.82,0,0,1-48.56-22.27,4.48,4.48,0,0,1-.26-5.65c7.22-9.7,20-32.64,22-40.11a10.91,10.91,0,0,0-4.14-4.33,4.45,4.45,0,0,1-2.55-3.6l-.72-7.33a4.47,4.47,0,0,1,8.89-.88l.5,5.1a22.16,22.16,0,0,1,6.8,8.64A4.37,4.37,0,0,1,75,60.56C74,68.5,61.16,91.46,53.24,103.07c18.49,18.43,40.59,16.75,41.56,16.66a4.47,4.47,0,0,1,.81,8.9C95.41,128.65,94.38,128.73,92.71,128.73Z"/><path class="cls-2" d="M236.75,306h-12a4.48,4.48,0,0,1-4.3-5.67c3.13-11.24,4.67-20.38,5.82-34.71-4.24-19.94-8.23-38.21-8.27-38.39a4.46,4.46,0,1,1,8.72-1.91c.05.19,4.13,18.86,8.42,39.08a4.23,4.23,0,0,1,.08,1.28c-1,12.86-2.31,21.75-4.67,31.38h6.17a4.47,4.47,0,1,1,0,8.94Z"/><path class="cls-2" d="M144.21,306h-6.76a4.47,4.47,0,0,1-4.42-5.09c1.14-8.2,7-23.13,13.29-38.14,2.24-19.8,4.06-36.8,4.08-37a4.47,4.47,0,1,1,8.88.95c0,.17-1.88,17.56-4.15,37.65a4.31,4.31,0,0,1-.32,1.22c-4.43,10.63-9.49,23.15-11.8,31.44h1.2a4.47,4.47,0,1,1,0,8.94Z"/><path class="cls-3" d="M148.1.89,96,53c-2.62,57.71-2.41,118.33,0,181.18H268.2C264.79,153,264.47,75,268.2.89Z"/><path class="cls-2" d="M268.2,235H96a.9.9,0,0,1-.9-.86c-2.49-65.26-2.49-126.25,0-181.26a.92.92,0,0,1,.26-.59L147.47.26A.88.88,0,0,1,148.1,0H268.2a.9.9,0,0,1,.65.28.93.93,0,0,1,.24.66c-3.59,71.34-3.59,147.61,0,233.17a.9.9,0,0,1-.89.93ZM96.89,233.25H267.27c-3.55-84.86-3.55-160.59,0-231.46H148.47L96.91,53.34C94.44,108,94.44,168.5,96.89,233.25Z"/><path d="M140.51,191.33V195h4.29v-3.64h1.63v9H144.8v-4.09h-4.29v4.09h-1.63v-9Z"/><path d="M150,196.14a2.9,2.9,0,0,0,3.1,3.14,5.93,5.93,0,0,0,2.5-.46l.28,1.17a7.34,7.34,0,0,1-3,.56,4.2,4.2,0,0,1-4.45-4.55c0-2.73,1.61-4.88,4.24-4.88,3,0,3.74,2.6,3.74,4.26a5.66,5.66,0,0,1-.06.76Zm4.82-1.17a2.34,2.34,0,0,0-2.28-2.67,2.72,2.72,0,0,0-2.52,2.67Z"/><path d="M164,191.33V195h4.3v-3.64h1.62v9h-1.62v-4.09H164v4.09h-1.62v-9Z"/><path d="M177.63,200.37l-.13-1.14h-.06a3.36,3.36,0,0,1-2.76,1.34,2.58,2.58,0,0,1-2.77-2.6c0-2.18,1.94-3.38,5.44-3.36v-.18a1.87,1.87,0,0,0-2.06-2.1,4.49,4.49,0,0,0-2.35.68l-.37-1.09a5.63,5.63,0,0,1,3-.8c2.77,0,3.44,1.89,3.44,3.7v3.38a13,13,0,0,0,.15,2.17Zm-.25-4.62c-1.79,0-3.83.28-3.83,2a1.46,1.46,0,0,0,1.56,1.57,2.25,2.25,0,0,0,2.18-1.52,1.54,1.54,0,0,0,.09-.52Z"/><path d="M183.13,191.33v3.81c0,1.43,0,2.33-.09,3.62l.06,0c.54-1.1.86-1.74,1.45-2.78l2.82-4.67h1.93v9h-1.57v-3.83c0-1.48,0-2.25.11-3.7h-.06c-.57,1.16-1,1.88-1.49,2.8-.86,1.4-1.85,3.14-2.82,4.73h-1.89v-9Zm1.07-3.68c.05.8.45,1.42,1.19,1.42s1.18-.6,1.27-1.42h1.18a2.25,2.25,0,0,1-2.48,2.31,2.18,2.18,0,0,1-2.36-2.31Z"/><path d="M199,191.33v7.8l.93,0-.09,4.09h-1.29l-.07-2.87h-6.26l-.08,2.87h-1.28l-.08-4.09.77,0a6.86,6.86,0,0,0,.89-1.85,11.74,11.74,0,0,0,.53-3.6v-2.35Zm-4.58,2.74a12.29,12.29,0,0,1-.46,3.36,8.6,8.6,0,0,1-.73,1.68h4.16v-6.53h-3Z"/><path d="M202.7,196.14a2.9,2.9,0,0,0,3.1,3.14,5.93,5.93,0,0,0,2.5-.46l.28,1.17a7.27,7.27,0,0,1-3,.56,4.2,4.2,0,0,1-4.45-4.55c0-2.73,1.61-4.88,4.24-4.88,2.95,0,3.74,2.6,3.74,4.26a5.66,5.66,0,0,1-.06.76Zm4.82-1.17a2.34,2.34,0,0,0-2.28-2.67,2.72,2.72,0,0,0-2.52,2.67Z"/><path d="M212.73,191.33V195H217v-3.64h1.63v9H217v-4.09h-4.29v4.09H211.1v-9Z"/><path d="M229.51,195.77a4.42,4.42,0,0,1-4.5,4.8,4.3,4.3,0,0,1-4.33-4.65c0-3,2-4.8,4.48-4.8S229.51,193,229.51,195.77Zm-7.17.09c0,2,1.14,3.48,2.75,3.48s2.74-1.48,2.74-3.51c0-1.54-.76-3.48-2.7-3.48S222.34,194.15,222.34,195.86Z"/><path d="M157.76,172.93v5.27h6.09v-5.27h1.64v12.59h-1.64v-5.9h-6.09v5.9h-1.63V172.93Z"/><path d="M169.76,176.48v3.81c0,1.44,0,2.33-.09,3.62l.06,0c.54-1.1.86-1.74,1.45-2.78l2.82-4.67h1.93v9h-1.57v-3.83c0-1.48,0-2.24.11-3.7h-.05c-.58,1.16-1,1.89-1.5,2.8-.86,1.4-1.85,3.14-2.82,4.73h-1.89v-9Z"/><path d="M179.88,176.48v3c0,1.14.43,1.92,1.87,1.92a3.4,3.4,0,0,0,1.94-.63v-4.26h1.63v9h-1.63v-3.63h0a4.78,4.78,0,0,1-2.45.69,2.67,2.67,0,0,1-3-3v-3.15Z"/><path d="M188.92,181.3a2.89,2.89,0,0,0,3.1,3.13,5.93,5.93,0,0,0,2.5-.46l.28,1.17a7.1,7.1,0,0,1-3,.56,4.2,4.2,0,0,1-4.45-4.55c0-2.73,1.61-4.88,4.24-4.88,2.95,0,3.74,2.6,3.74,4.26a5.85,5.85,0,0,1-.06.77Zm4.82-1.18a2.34,2.34,0,0,0-2.28-2.67,2.72,2.72,0,0,0-2.52,2.67Z"/><path d="M202.87,176.48v1.32H199v7.72h-1.63v-9Z"/><path d="M212.36,180.92a4.42,4.42,0,0,1-4.5,4.8,4.3,4.3,0,0,1-4.34-4.65c0-3,2-4.8,4.48-4.8S212.36,178.16,212.36,180.92Zm-7.18.1c0,2,1.14,3.47,2.75,3.47s2.75-1.48,2.75-3.51c0-1.53-.77-3.48-2.71-3.48S205.18,179.3,205.18,181Z"/><path class="cls-4" d="M237.33,209.37H218.55a.67.67,0,1,1,0-1.33h18.78a.67.67,0,1,1,0,1.33Z"/><path class="cls-4" d="M210.77,209.37H126.91a.67.67,0,1,1,0-1.33h83.86a.67.67,0,1,1,0,1.33Z"/><path class="cls-4" d="M158.17,109.1c-.2-4.36-2.68-7.8-5.53-7.7s-5,3.72-4.82,8.07,2.67,7.8,5.53,7.7S158.36,113.45,158.17,109.1Z"/><path class="cls-4" d="M218.54,107.74c-.2-4.36-2.67-7.8-5.53-7.7s-5,3.72-4.82,8.07,2.67,7.8,5.53,7.7S218.74,112.09,218.54,107.74Z"/><path class="cls-4" d="M173.24,126.94c15.83-5.65,28.06,1,28.62,1.3a1.29,1.29,0,0,1,.5,1.74,1.3,1.3,0,0,1-1.75.49c-.15-.08-14.4-7.76-31.41,1a1.3,1.3,0,0,1-1.74-.54,1.26,1.26,0,0,1,.54-1.72A42.49,42.49,0,0,1,173.24,126.94Z"/><path class="cls-4" d="M149.53,68.25a2.64,2.64,0,0,1,1.26.36,2.57,2.57,0,0,1,.91,3.51,25.28,25.28,0,0,1-19.54,12.76,2.59,2.59,0,0,1-2.69-2.45,2.53,2.53,0,0,1,2.44-2.65h0c.39,0,9.62-.59,15.36-10.28A2.55,2.55,0,0,1,149.53,68.25Z"/><path class="cls-4" d="M209.94,66.78a2.6,2.6,0,0,1,2.33.72c8,8,17.14,6.39,17.52,6.32a2.59,2.59,0,0,1,3,2,2.52,2.52,0,0,1-2,3c-.5.09-12.14,2.32-22.21-7.75a2.55,2.55,0,0,1,0-3.61A2.69,2.69,0,0,1,209.94,66.78Z"/><path class="cls-5" d="M265.61,94.77l-7.31.69a5.23,5.23,0,0,1-5.58-4.06L242.59,46a5.22,5.22,0,0,1,3.77-6.19L266,34.69Z"/><path class="cls-5" d="M152.9,57.6c-5.09-13.89-10.17-36.12-4.8-56.71L96,53C110.75,57.88,134.21,60,152.9,57.6Z"/><path class="cls-3" d="M148.1,53c-5.71-16.86-3.38-39.78,0-52.07L96,53C111.8,55.83,129.4,55.38,148.1,53Z"/><path class="cls-2" d="M119.85,55.84a134.06,134.06,0,0,1-24-2,.9.9,0,0,1-.7-.62.89.89,0,0,1,.22-.89L147.47.26a.89.89,0,0,1,1.49.87c-3.15,11.44-5.75,34.6,0,51.54a.93.93,0,0,1-.09.76.87.87,0,0,1-.64.41A222,222,0,0,1,119.85,55.84Zm-22-3.47c13.83,2.29,29.91,2.24,49-.16-4.71-14.93-3.65-34.7-.48-48.4Z"/><path class="cls-2" d="M327,129a1.5,1.5,0,0,1-1.44-1.12L307.21,58a1.49,1.49,0,0,1,2.89-.76l18.34,69.88a1.5,1.5,0,0,1-1.07,1.83A1.58,1.58,0,0,1,327,129Z"/><rect class="cls-4" x="250.5" y="14.78" width="109.05" height="58.03" rx="5.24" transform="translate(-1.13 78.85) rotate(-14.7)"/><rect class="cls-4" x="277.39" y="64.28" width="72.67" height="25.34" rx="5.24" transform="translate(-9.26 82.15) rotate(-14.7)"/><path class="cls-3" d="M264.43,42.9l7.1-1.87,12.85,11.18L280.8,38.59,288,36.71l6.48,24.6-7.17,1.89L274.5,52.11l3.56,13.51-7.15,1.88Z"/><path class="cls-3" d="M295.3,48q-1.59-6,.89-10.26c1.64-2.83,4.47-4.77,8.46-5.82s7.54-.81,10.33.81,4.72,4.4,5.76,8.36a15.81,15.81,0,0,1,.41,7.46,10.8,10.8,0,0,1-3.07,5.4,14.36,14.36,0,0,1-6.43,3.33,16.37,16.37,0,0,1-7.24.49,10.84,10.84,0,0,1-5.53-3A14.47,14.47,0,0,1,295.3,48Zm7.61-2q1,3.74,2.79,5A5.41,5.41,0,0,0,313.27,49c.62-1.3.56-3.33-.16-6.08-.61-2.32-1.52-3.88-2.74-4.71a5,5,0,0,0-4.22-.6,4.76,4.76,0,0,0-3.26,2.6Q301.92,42.23,302.91,46Z"/><path class="cls-3" d="M319,28.53l23.1-6.08,1.6,6.08-7.75,2,4.88,18.53-7.61,2-4.87-18.53-7.76,2Z"/><path class="cls-3" d="M292.68,78.74l1.66-.45.68,2.55-1.65.44,1.75,6.53-3.48.94-1.76-6.53-1.3.35L287.9,80l1.3-.35-.11-.41a6.91,6.91,0,0,1-.21-1.25A2.59,2.59,0,0,1,289,76.8a2.46,2.46,0,0,1,.74-.93,4.79,4.79,0,0,1,1.67-.73,25.4,25.4,0,0,1,2.71-.5l.18,2.21a6.27,6.27,0,0,0-1,.17,1.16,1.16,0,0,0-.63.33,1,1,0,0,0-.16.58A5,5,0,0,0,292.68,78.74Z"/><path class="cls-3" d="M296.12,82.71a4.72,4.72,0,0,1,.48-3.8,6.27,6.27,0,0,1,8-1.89,5.11,5.11,0,0,1,1.49,6.64A5.49,5.49,0,0,1,302.58,86a5.57,5.57,0,0,1-3.83-.15A4.64,4.64,0,0,1,296.12,82.71Zm3.48-.95a2.8,2.8,0,0,0,1,1.66,1.67,1.67,0,0,0,2.47-.65,3,3,0,0,0,0-2,2.75,2.75,0,0,0-1-1.62,1.56,1.56,0,0,0-1.36-.26,1.65,1.65,0,0,0-1.1.93A2.78,2.78,0,0,0,299.6,81.76Z"/><path class="cls-3" d="M319,81.39l-3.25.88-.39-1.47a5.17,5.17,0,0,1-1.12,1.68,4.06,4.06,0,0,1-1.71.87A3.05,3.05,0,0,1,310,83.1a3.88,3.88,0,0,1-1.52-2.43L307,74.9l3.49-.94,1.34,5a1.9,1.9,0,0,0,.64,1.13,1.19,1.19,0,0,0,1,.12,1.31,1.31,0,0,0,.89-.75,2.83,2.83,0,0,0-.07-1.83l-1.17-4.36,3.48-.94Z"/><path class="cls-3" d="M318.66,71.75l3.23-.87.4,1.48a5.17,5.17,0,0,1,1.12-1.69,4.06,4.06,0,0,1,1.71-.87,3.05,3.05,0,0,1,2.49.25,3.87,3.87,0,0,1,1.53,2.43l1.55,5.77-3.5.94-1.34-5a1.79,1.79,0,0,0-.64-1.12,1.17,1.17,0,0,0-1-.12,1.31,1.31,0,0,0-.9.75,3,3,0,0,0,.07,1.83l1.17,4.35-3.47.94Z"/><path class="cls-3" d="M339,62.6l3.36,12.52-3.25.88-.36-1.34a4.49,4.49,0,0,1-.94,1.48,3.68,3.68,0,0,1-1.57.85,3.37,3.37,0,0,1-3.21-.65,6.08,6.08,0,0,1-1.9-3.16,5.15,5.15,0,0,1,.16-3.74,3.66,3.66,0,0,1,2.42-1.94,4.15,4.15,0,0,1,1.55-.12,3.43,3.43,0,0,1,1.39.5l-1.16-4.34Zm-1.35,8.9a2.45,2.45,0,0,0-.88-1.47,1.47,1.47,0,0,0-1.28-.22,1.33,1.33,0,0,0-.89.78,2.85,2.85,0,0,0,.05,1.8,2.61,2.61,0,0,0,.86,1.51,1.34,1.34,0,0,0,1.18.24,1.45,1.45,0,0,0,1-.82A2.67,2.67,0,0,0,337.6,71.5Z"/></g></g></svg>
                                                <!--Title-->
                                                <div class="sp_no_search_result_title">
                                                    К сожалению, по Вашему запросу ничего не было найдено.
                                                </div>
                                            </div>
                                        </div>
                                    <?php endif; ?>
                                </div>
                                <?php if($questions): ?>
                                    <!--Pagination-->
                                    <?php if($pagination->countPages > 1): ?>
                                        <div class="history_pagination">
                                            <?=$pagination;?>
                                        </div>
                                    <?php endif; ?>
                                    <!--Pagination Mobile-->
                                    <?php if($mobile_pagination->countPages > 1): ?>
                                        <div class="history_pagination_mobile">
                                            <?=$mobile_pagination;?>
                                        </div>
                                    <?php endif; ?>
                                <?php endif; ?>
                            </div>
                            
                            <div class="search_page_right">
                                <div class="search_page_right_inner">
                                    <!--Ask a Question-->
                                    <div class="sp_ask_question" id='asideItem'>
                                        <div class="sp_ask_question_inner">
                                            <!--Title-->
                                            <div class="sp_ask_question_title">
                                                Не нашли ответ на свой вопрос?
                                            </div>
                                            <!--Text-->
                                            <div class="sp_ask_question_text">
                                                Напишите нам о своей проблеме и мы постараемся решить ее в ближайшее время.
                                            </div>
                                            <!--Button-->
                                            <a href='/feedback' class="sp_ask_question_button" tabindex="-2">
                                                Задать вопрос
                                            </a>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <!--Ask A Question Mobile-->
                        <div class="sp_ask_question_mobile">
                            <div class="sp_ask_question_mobile_inner">
                                <!--Left-->
                                <div class="sp_ask_question_mobile_left">
                                    <div class="sp_ask_question_mobile_title">
                                        Не нашли ответ на свой вопрос?
                                    </div>
                                    <div class="sp_ask_question_mobile_text">
<span>
Не нашли ответ на свой вопрос?
</span>
                                        Напишите нам о своей проблеме и мы постараемся решить ее в ближайшее время.
                                    </div>
                                </div>
                                <!--Right-->
                                <div class="sp_ask_question_mobile_right">
                                    <!--Button-->
                                    <a href='/feedback' class="sp_ask_question_mobile_button" tabindex="-2">
                                        Задать вопрос
                                    </a>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</div>





<script src='/public/js/search/main.js'></script>
<script src='/public/js/search/app.js'></script>